In [1]:
#Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

import pandas as pd

data = [4, 8, 15, 16, 23, 42]

s = pd.Series(data)

s

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [2]:
#Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

import pandas as pd

list = [1,2,3,4,5,6,7,8,9,10]
l = pd.Series(list)
l

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [3]:
#Q3. Create a Pandas DataFrame that contains the following data:

import pandas as pd

data3 = {'Name':['Alice', 'Bob', 'Claire'], 'Age':[25,30,27], 'Gender':['female', 'male', 'female']}

df = pd.DataFrame(data3)

df

     Name  Age  Gender
0   Alice   25  female
1     Bob   30    male
2  Claire   27  female

In [5]:
#Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

# Dataframe is two dimensional structure with columns and rows whose size can be changed. It can assumed as dictionary of Series Objects. 
# The data parameter can take any of the following data types in DataFrame whereas Series contains elements of similar datatype.
# Series can only contain single list with index, whereas dataframe can be made of more than one series or we can say that a dataframe is a collection of series that can be used to analyse the data.
# Size of Series is immutable whereas that of DataFrame can be change after creation.

#series
list = [1,2,3,4]
data4 = pd.Series(list)
data4

0    1
1    2
2    3
3    4
dtype: int64

In [6]:
list = [1,2,3,4, 'Mahesh', True]
data5 = pd.Series(list)
data5

0         1
1         2
2         3
3         4
4    Mahesh
5      True
dtype: object

In [ ]:
# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame?
# Can give an example of when you might use one of these functions?

# .apply() - The Pandas apply() function can be used to apply a function on every value in a column or row of a DataFrame, and 
#transform that column or row to the resulting values. By default, it will apply a function to all values of a column.

# .drop(axis=1) - to delete any col

# .rename() - to rename any of the column

# .loc() and .iloc() - These are used in slicing data from the Pandas DataFrame. They help in the convenient selection of data from the DataFrame in Python.

In [9]:
# Example-
data = {"a":[1,2,3,4],
        "b":[4,5,6,7],
        "c":["sudh","krish","hitesh","navin"]
       }
df1=pd.DataFrame(data, index=['a','b','c','d'])
df1

   a  b       c
a  1  4    sudh
b  2  5   krish
c  3  6  hitesh
d  4  7   navin

In [8]:
def test(x):
    return x.sum()
df1.apply(test, axis=0)

a                      10
b                      22
c    sudhkrishhiteshnavin
dtype: object

In [11]:
df1.drop('b', axis =1 )

   a       c
a  1    sudh
b  2   krish
c  3  hitesh
d  4   navin

In [16]:
df1.rename(columns={'a':'d'})

   d  b       c
a  1  4    sudh
b  2  5   krish
c  3  6  hitesh
d  4  7   navin

In [24]:
df1.iloc[0:1] #excludes 1

   a  b     c
a  1  4  sudh

In [23]:
df1.loc['a':'d'] #includes 'd' too

   a  b       c
a  1  4    sudh
b  2  5   krish
c  3  6  hitesh
d  4  7   navin

In [25]:
#Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

#DataFrame and Panel are mutable while Series is immutable

In [26]:
#Q7. Create a DataFrame using multiple Series. Explain with an example.

import pandas as pd
# Create pandas Series
courses = pd.Series(["Spark","PySpark","Hadoop"])
fees = pd.Series([22000,25000,23000])
discount  = pd.Series([1000,2300,1000])

# Combine two series.
df=pd.concat([courses,fees],axis=1)

# It also supports to combine multiple series.
df=pd.concat([courses,fees,discount],axis=1)
print(df)

         0      1     2
0    Spark  22000  1000
1  PySpark  25000  2300
2   Hadoop  23000  1000